{"<unk>": 0, "_": 1, "d": 2, "e": 3, "f": 4, "t": 5, "r": 6, "a": 7, "i": 8, "n": 9, "(": 10, ",": 11, "m": 12, "o": 13, "l": 14, "s": 15, "v": 16, "p": 17, "h": 18, "=": 19, "N": 20, "g": 21, "b": 22, "k": 23, "'": 24, "F": 25, ")": 26, ":": 27, "\n": 28, "\"": 29, "T": 30, "-": 31, "c": 32, ".": 33, "y": 34, "u": 35, "w": 36, "V": 37, "x": 38, "S": 39, "<": 40, ">": 41, "/": 42, "\u251c": 43, "\u2500": 44, "1": 45, "\u2502": 46, "j": 47, "2": 48, "\u2514": 49, "C": 50, "X": 51, "[": 52, "]": 53, "#": 54, "L": 55, "!": 56, "I": 57, "{": 58, "}": 59, "D": 60, "A": 61, "0": 62, "K": 63, "q": 64, "6": 65, "R": 66, "z": 67, "O": 68, "W": 69, "E": 70, "M": 71, "U": 72, "P": 73, "G": 74, "B": 75, "5": 76, "8": 77, "+": 78, "3": 79, "H": 80, "*": 81, "Q": 82, "J": 83, "7": 84, "4": 85, "`": 86, "%": 87, "\\": 88, "?": 89, "Y": 90, ";": 91, "&": 92, "9": 93, "^": 94, "|": 95, "~": 96, "@": 97, "Z": 98, "$": 99, "\u00f6": 100, "in": 101, "_t": 102, "_s": 103, "on": 104, "re": 105, "at": 106, "_a": 107, "er": 108, "or": 109, "_i": 110, "el": 111, "ar": 112, "_d": 113, "he": 114, "al": 115, ")\n": 116, "_c": 117, "am": 118, "es": 119, "_=": 120, "_f": 121, ":\n": 122, "_n": 123, "en": 124, "_in": 125, "_o": 126, "se": 127, "ti": 128, "_p": 129, "_the": 130, "_re": 131, "le": 132, "st": 133, "_\"": 134, "_m": 135, "an": 136, "ed": 137, "ur": 138, "ex": 139, "_l": 140, "elf": 141, "_b": 142, ".\n": 143, "ro": 144, "et": 145, "_w": 146, "_is": 147, "pe": 148, "urn": 149, "ing": 150, "_to": 151, "ct": 152, "um": 153, "ce": 154, "as": 155, "ef": 156, "_if": 157, "it": 158, "ul": 159, "\"\"": 160, "ra": 161, "nd": 162, "turn": 163, "par": 164, "):\n": 165, "_v": 166, "_\"\"\"": 167, "elf.": 168, "ol": 169, "one": 170, "_of": 171, "_return": 172, "ame": 173, "alu": 174, "ot": 175, "_:": 176, "_def": 177, "un": 178, "_>": 179, "_\"\"\"\n": 180, "_#": 181, "_self.": 182, "None": 183, "ype": 184, "_(": 185, "tion": 186, "_st": 187, "_for": 188, "ata": 189, "_>>": 190, "_>>>": 191, "is": 192, "(s": 193, "od": 194, "ate": 195, "\n\n": 196, "_1": 197, "ut": 198, "_T": 199, "_j": 200, ".\n\n": 201, "up": 202, "ic": 203, "_'": 204, "_[": 205, "ke": 206, "ow": 207, "ult": 208, "_g": 209, "im": 210, ")\n\n": 211, "_`": 212, "th": 213, "_None": 214, "_not": 215, "si": 216, "_valu": 217, "_or": 218, "),": 219, "_u": 220, "em": 221, "_th": 222, "ll": 223, "ma": 224, "ent": 225, "unc": 226, "_S": 227, "_and": 228, "ge": 229, "ab": 230, "s.": 231, "',": 232, "_R": 233, "ve": 234, "_be": 235, "ad": 236, "_el": 237, "id": 238, "ist": 239, "ig": 240, "_2": 241, "onn": 242, "oc": 243, "om": 244, "ort": 245, "all": 246, "if": 247, "s,": 248, "_0": 249, "ter": 250, "_ex": 251, "_I": 252, "ch": 253, "param": 254, "_con": 255, "ect": 256, "bj": 257, "ap": 258, "pl": 259, "iz": 260, "_-": 261, "qu": 262, "ith": 263, "]\n": 264, "ati": 265, "_ind": 266, "_h": 267, "_as": 268, "park": 269, "(\"": 270, ".s": 271, "tr": 272, "_r": 273, "_:param": 274, "_sc": 275, ",\n": 276, ".c": 277, "_fi": 278, "_data": 279, "rom": 280, "_str": 281, "te": 282, "(self": 283, "olum": 284, "olumn": 285, "ext": 286, "ray": 287, "_par": 288, "ault": 289, "_.": 290, "_D": 291, "_ar": 292, "key": 293, "_e": 294, "ue": 295, "av": 296, "ver": 297, "_+": 298, "_num": 299, "ror": 300, "_C": 301, "_from": 302, "Par": 303, "me": 304, "ance": 305, "tit": 306, "_name": 307, "and": 308, "to": 309, ".0": 310, "_it": 311, "ta": 312, "dd": 313, "_ne": 314, "ass": 315, "_index": 316, "end": 317, "ize": 318, "_with": 319, "ation": 320, "_A": 321, "rame": 322, "op": 323, "_obj": 324, "_an": 325, "()": 326, "sed": 327, "_se": 328, "_res": 329, "_value": 330, "lo": 331, "_len": 332, "titonn": 333, "(self,": 334, "s\n": 335, "oin": 336, "Er": 337, "_func": 338, "_*": 339, "_else": 340, "li": 341, "ay": 342, "()\n": 343, "_values": 344, "_``": 345, "ise": 346, "Error": 347, "stance": 348, "odel": 349, "Frame": 350, "cl": 351, "ath": 352, "df": 353, "ava": 354, "ind": 355, "--": 356, "roup": 357, "type": 358, "('": 359, "ht": 360, "res": 361, "ck": 362, "ri": 363, "_df": 364, "_list": 365, "_op": 366, "ndex": 367, "_type": 368, "sion": 369, "mat": 370, "row": 371, "DD": 372, "arg": 373, "_set": 374, "_ra": 375, "alue": 376, "eri": 377, "rue": 378, "_result": 379, "ple": 380, "_key": 381, "_..": 382, "_isin": 383, "=None": 384, "\",": 385, "set": 386, "ight": 387, "port": 388, "_==": 389, "put": 390, "_ma": 391, "_3": 392, ".f": 393, "_default": 394, "---": 395, "_else:\n": 396, "))\n": 397, "_isinstance": 398, "([": 399, "_id": 400, "_we": 401, "_raise": 402, "ill": 403, "est": 404, "_this": 405, "_%": 406, "],": 407, "ec": 408, "art": 409, "Type": 410, "_sh": 411, "_cl": 412, "_new": 413, "``": 414, "_on": 415, "text": 416, "age": 417, "_string": 418, "_If": 419, "_P": 420, "che": 421, "ly": 422, "_x": 423, "_F": 424, "_column": 425, "ken": 426, "name": 427, "ataFrame": 428, "il": 429, "red": 430, ").": 431, "_lo": 432, "(d": 433, "_N": 434, "_pro": 435, "_all": 436, "pt": 437, "_le": 438, "ir": 439, "_are": 440, "yp": 441, "abel": 442, "able": 443, "eturn": 444, ":`": 445, "Con": 446, "alse": 447, "__": 448, "-----": 449, "ess": 450, "_im": 451, "_None:\n": 452, "_function": 453, "ace": 454, "_that": 455, "ict": 456, "_us": 457, "p.": 458, "_tim": 459, "_RDD": 460, "1,": 461, "_k": 462, "ou": 463, "_will": 464, "ql": 465, "------": 466, "vel": 467, "_The": 468, "_model": 469, "_X": 470, "))": 471, "_com": 472, "_get": 473, "_V": 474, "_E": 475, "_isinstance(": 476, "pec": 477, "ream": 478, "_array": 479, "_Return": 480, "_by": 481, "ample": 482, "ep": 483, "co": 484, ".d": 485, "_path": 486, "nt": 487, "ask": 488, "s(": 489, "reate": 490, "ames": 491, "time": 492, "_token": 493, "_tr": 494, "iv": 495, "class": 496, "_X|": 497, "_M": 498, ".g": 499, "])\n": 500, "_-------": 501, "py": 502, "_ver": 503, "ub": 504, "oul": 505, "Partitonn": 506, "ould": 507, "_at": 508, "s[": 509, "ave": 510, "ach": 511, "ector": 512, "_True": 513, "ile": 514, "_file": 515, "_dtype": 516, "_{": 517, "ust": 518, "s)": 519, "(l": 520, "00": 521, "spark": 522, "ine": 523, "_wh": 524, "_object": 525, "ord": 526, "_ax": 527, "_can": 528, "ther": 529, "ode": 530, "orm": 531, "str": 532, "andas": 533, "_param": 534, "ow(": 535, "_group": 536, "ber": 537, "_ac": 538, "class:`": 539, "_...": 540, "_met": 541, "valu": 542, "_|": 543, "ifi": 544, "_used": 545, "_java": 546, "ore": 547, "eter": 548, "Context": 549, "rain": 550, "eld": 551, "_len(": 552, "_spec": 553, "ans": 554, "ator": 555, "_sche": 556, "_other": 557, "gth": 558, "_Spark": 559, "rit": 560, "ure": 561, "ast": 562, "_sort": 563, "_en": 564, "t(": 565, "ary": 566, "_import": 567, "_y": 568, "_un": 569, "_:class:`": 570, "ock": 571, "_<": 572, "_np.": 573, "ger": 574, "lect": 575, "_max": 576, "_log": 577, "e,": 578, "ated": 579, "da": 580, "_whe": 581, "_label": 582, "0,": 583, "_W": 584, "_elif": 585, "_schema": 586, "thon": 587, "_end": 588, "_start": 589, "uct": 590, "ull": 591, "_L": 592, "array": 593, "_input": 594, "_po": 595, "obj": 596, "_option": 597, "Index": 598, "_py": 599, "_each": 600, "efault": 601, "_col": 602, "='": 603, "_Value": 604, "Param": 605, "_exce": 606, "_out": 607, "ape": 608, "._j": 609, "01": 610, "=None,": 611, "')": 612, "de": 613, "val": 614, "(self.": 615, "_ValueError": 616, "(\n": 617, "alize": 618, "arr": 619, "_5": 620, "es\n": 621, "St": 622, "_Th": 623, "fo": 624, "_names": 625, "_dict": 626, "tive": 627, "ange": 628, "_min": 629, "_has": 630, "_DataFrame": 631, "(f": 632, "_conver": 633, "_co": 634, "vm": 635, "_ch": 636, "_pre": 637, "col": 638, "warg": 639, "_al": 640, "_B": 641, "_row": 642, "_should": 643, "inn": 644, "64": 645, "ulti": 646, "ampl": 647, "opy": 648, "pu": 649, "atch": 650, "ase": 651, "_do": 652, "_date": 653, "pp": 654, "\")\n": 655, "int": 656, "indow": 657, "s=": 658, "_Ex": 659, "_he": 660, "oint": 661, "_spark": 662, "2,": 663, "_rdd": 664, "_rec": 665, "ell": 666, "_axis": 667, "app": 668, "s)\n": 669, "na": 670, "_self._j": 671, "orr": 672, ":\n\n": 673, "_level": 674, "values": 675, ".j": 676, "]\n\n": 677, "ormat": 678, "pr": 679, "heck": 680, "_G": 681, "_sp": 682, "_mask": 683, "ib": 684, "con": 685, "._": 686, ".sql": 687, "_partitonn": 688, "_loc": 689, "_use": 690, "bda": 691, "hod": 692, "ption": 693, "ypes": 694, "_This": 695, "ified": 696, "_J": 697, "rdd": 698, ")\n)\n": 699, "[0": 700, "s:": 701, "ates": 702, "_time": 703, "ambda": 704, "_length": 705, "err": 706, "_call": 707, "::": 708, "_indexer": 709, "loat": 710, "s):\n": 711, "ack": 712, "_number": 713, ".t": 714, "ython": 715, "quen": 716, "son": 717, "_U": 718, "_Type": 719, "ment": 720, "ction": 721, "ias": 722, "(p": 723, "form": 724, "place": 725, "fi": 726, "rent": 727, "In": 728, "_doc": 729, "By": 730, "DataFrame": 731, "_4": 732, "|\n": 733, "ion": 734, "_method": 735, "_**": 736, "_[R": 737, "(n": 738, "ft": 739, "der": 740, "y:\n": 741, "unt": 742, "uple": 743, "lice": 744, "iti": 745, "ich": 746, "default": 747, "_False": 748, "_int": 749, "map": 750, "spark.sql": 751, "oth": 752, "lock": 753, "_arg": 754, "\"\n": 755, "_None|": 756, "_format": 757, "attr": 758, "_inter": 759, "imit": 760, "_val": 761, "u'": 762, "ser": 763, "_specified": 764, "_one": 765, "ark": 766, "ents": 767, "_check": 768, "out": 769, "-0": 770, "_iter": 771, "_0.": 772, "rix": 773, "eries": 774, "Data": 775, "_elem": 776, "ick": 777, "-1": 778, "=None):\n": 779, "andom": 780, "_2,": 781, "_qu": 782, "_which": 783, "_except": 784, "_SparkContext": 785, "iven": 786, "s:\n": 787, "allel": 788, "min": 789, "ices": 790, "erialize": 791, ".0,": 792, "fer": 793, "_TypeError": 794, "start": 795, "tain": 796, "_must": 797, "chema": 798, "_seed": 799, "_copy": 800, "_so": 801, "_text": 802, "_convert": 803, "rite": 804, ".par": 805, "_posi": 806, "Func": 807, "_have": 808, "_Column": 809, "atrix": 810, "_Index": 811, "ory": 812, "ide": 813, "\")": 814, "tring": 815, "eat": 816, "sc": 817, ".w": 818, "_Param": 819, "_the\n": 820, "_None\n": 821, "=u'": 822, "_pa": 823, "(x": 824, "_weight": 825, "')\n": 826, "_(default": 827, "ache": 828, "Stream": 829, "_given": 830, "_try:\n": 831, "value": 832, "_item": 833, "201": 834, "(j": 835, "_[Row(": 836, "_bo": 837, "_2.": 838, "gn": 839, "True": 840, "ify": 841, "_conf": 842, "return": 843, "_O": 844, "s.\n": 845, ")\n\n\n": 846, ".col": 847, "._jvm": 848, "ener": 849, "Model": 850, "_em": 851, "d.": 852, "_pandas": 853, "_fre": 854, "upport": 855, "_into": 856, "_H": 857, "ob": 858, "False": 859, "_numPartitonn": 860, "_vector": 861, "_contain": 862, "_no": 863, "(m": 864, "_only": 865, "_active": 866, "erializer": 867, "elect": 868, "(t": 869, "les": 870, "ound": 871, "amp": 872, "`.\n\n": 873, "ip": 874, "ng": 875, "_up": 876, "_comp": 877, "ey": 878, "])": 879, "+\n": 880, "plit": 881, "_when": 882, "_%s": 883, "uce": 884, "append": 885, "ces": 886, "arn": 887, "_True\n": 888, "_version": 889, "_position": 890, "_map": 891, "_add": 892, "':": 893, "_sub": 894, "other": 895, "_----------": 896, "_class": 897, "Name": 898, "_In": 899, "_any": 900, "(sc": 901, "kwarg": 902, "_idx": 903, "_Parameter": 904, "_null": 905, "(data": 906, "_limit": 907, "tra": 908, "'s": 909, "_order": 910, "(c": 911, "_batch": 912, "read": 913, "s.\n\n": 914, "add": 915, "estamp": 916, "_Parameters\n": 917, "ree": 918, ".m": 919, "_create": 920, "Ar": 921, "rst": 922, "_window": 923, "_----------\n": 924, "low": 925, "func": 926, "po": 927, "_float": 928, "allelize": 929, "_make": 930, "ff": 931, "pro": 932, "per": 933, "_but": 934, "so": 935, "_\"\n": 936, "_self": 937, "_first": 938, "_:return": 939, ".join": 940, ".format": 941, "_tuple": 942, "get": 943, "item": 944, "),\n": 945, "act": 946, "RDD": 947, "reg": 948, "like": 949, "_ValueError(\"": 950, "_field": 951, "gg": 952, ".collect": 953, ".in": 954, ".parallelize": 955, "_cont": 956, "(obj": 957, "_**kwarg": 958, "path": 959, "gor": 960, "led": 961, ".select": 962, "ally": 963, "_{}": 964, "_using": 965, "_range": 966, "cess": 967, "_['": 968, "_1,": 969, ".get": 970, "ble": 971, "=False": 972, "_self.s": 973, "ax": 974, "hape": 975, "_\"\"\"\n\n": 976, "ression": 977, "urrent": 978, "teger": 979, "_SparkContext.": 980, ".create": 981, "_note": 982, "_sc.parallelize": 983, "_record": 984, "_me": 985, "atetime": 986, "assed": 987, "_non": 988, "t\n": 989, "_size": 990, "Non": 991, "e)\n": 992, "_sorted": 993, "df.": 994, "unction": 995, "ield": 996, "_state": 997, "g.": 998, "_set,": 999, "_-1": 1000, "umm": 1001, "ea": 1002, "ero": 1003, "_same": 1004, ")]\n": 1005, "=True": 1006, "_allow": 1007, "_(default:": 1008, "error": 1009, "_line": 1010, ".createDataFrame": 1011, "_[]\n": 1012, "_z": 1013, "_mem": 1014, "arning": 1015, "_need": 1016, "max": 1017, "-01": 1018, "_orig": 1019, "itial": 1020, "['": 1021, "_value,": 1022, "_uses": 1023, "(1": 1024, "\\\n": 1025, "_sing": 1026, "_block": 1027, "_sl": 1028, "que": 1029, "emp": 1030, "_tokens": 1031, "_than": 1032, "_dist": 1033, "inal": 1034, "=1": 1035, "fe": 1036, "Key": 1037, "tic": 1038, "File": 1039, "_passed": 1040, "_1\n": 1041, "(lambda": 1042, "_multi": 1043, "_gener": 1044, "_Returns\n": 1045, "_-------\n": 1046, "_feat": 1047, "(r": 1048, "ument": 1049, ".function": 1050, "_train": 1051, "ew": 1052, "_0:\n": 1053, "_active_spark": 1054, "_active_spark_c": 1055, "_Java": 1056, "data": 1057, "fix": 1058, "_ap": 1059, "amples": 1060, "_output": 1061, "_exp": 1062, "_wra": 1063, "_valid": 1064, "ense": 1065, "mage": 1066, "mo": 1067, "ead": 1068, "_SparkContext._active_spark_c": 1069, "not": 1070, ".co": 1071, "num": 1072, "uration": 1073, "_reg": 1074, "DataFrame`": 1075, "ery": 1076, "train": 1077, "\n\n\n": 1078, "index": 1079, "_1.0": 1080, "eight": 1081, "ases": 1082, "truct": 1083, "_inst": 1084, "_SparkContext._active_spark_cte": 1085, "_note::": 1086, "_example": 1087, "_For": 1088, "by": 1089, "_SparkContext._active_spark_cteex": 1090, "ong": 1091, "_then": 1092, "_cls.": 1093, "-+": 1094, "_:return:": 1095, "_!": 1096, "_!=": 1097, "ON": 1098, "ply": 1099, "point": 1100, "sg": 1101, "_pd.": 1102, "_single": 1103, "_('": 1104, "_sequen": 1105, "_config": 1106, "_off": 1107, "_pr": 1108, ".p": 1109, "_Python": 1110, "'\n": 1111, "000": 1112, "group": 1113, "_char": 1114, "ns": 1115, "_df.select": 1116, "ical": 1117, "_support": 1118, "_returns": 1119, "s[0": 1120, "_nd": 1121, "ole": 1122, "_+=": 1123, "rect": 1124, "f,": 1125, "ule": 1126, "rop": 1127, "sert": 1128, "_timestamp": 1129, "way": 1130, "_DStream": 1131, "_spark.createDataFrame": 1132, "ity": 1133, "ickle": 1134, "pty": 1135, "],\n": 1136, ".g.": 1137, "esc": 1138, "ee": 1139, "_li": 1140, "ique": 1141, "ategor": 1142, "valid": 1143, "atonn": 1144, "_load": 1145, "ted": 1146, "terr": 1147, "zone": 1148, "_Row(": 1149, "(self):\n": 1150, "_dataset": 1151, "ies": 1152, "(se": 1153, "arget": 1154, "_extra": 1155, "Vector": 1156, "parse": 1157, "_Num": 1158, "'t": 1159, "))\n\n": 1160, "_dec": 1161, "()\n\n": 1162, "_TypeError(\"": 1163, "_\\\n": 1164, "_udf": 1165, "imum": 1166, "Value": 1167, "_sample": 1168, "_ta": 1169, "ines": 1170, "_SparkContext._active_spark_cteext\n": 1171, "ansform": 1172, "sure": 1173, "ac": 1174, "(),": 1175, "[0]": 1176, "Array": 1177, ").\n": 1178, "Re": 1179, "_random": 1180, "_red": 1181, "odes": 1182, "_logger": 1183, "[1": 1184, "(v": 1185, "_assert": 1186, "tern": 1187, "erge": 1188, "_1.": 1189, "_stream": 1190, "_count": 1191, "ative": 1192, "_user": 1193, "-d": 1194, "file": 1195, "ard": 1196, "_over": 1197, "eric": 1198, "ined": 1199, "Alice": 1200, "_initial": 1201, "elta": 1202, "_offset": 1203, "ultiIndex": 1204, "ss": 1205, "clu": 1206, "_types": 1207, ".S": 1208, "())\n": 1209, "rec": 1210, "_timezone": 1211, "_columns": 1212, "_elements": 1213, "_3,": 1214, "_kwarg": 1215, "ag": 1216, "orage": 1217, "_dep": 1218, ".0\n": 1219, "Cl": 1220, "_exist": 1221, "Col": 1222, "olid": 1223, "_%s\"": 1224, "au": 1225, ".collect()\n": 1226, "\\n": 1227, "_cor": 1228, "ing\n": 1229, ")):\n": 1230, "iction": 1231, "_av": 1232, "_last": 1233, "ote": 1234, "Map": 1235, "_local": 1236, "`\n": 1237, "ssi": 1238, "_sc.parallelize([": 1239, "--+\n": 1240, "DF": 1241, "eriod": 1242, "_Con": 1243, ".r": 1244, "_parameter": 1245, "_attr": 1246, "erve": 1247, "_json": 1248, "_:class:`DataFrame`": 1249, "._jvm.function": 1250, "oliday": 1251, ".is": 1252, "_image": 1253, "_current": 1254, "_enc": 1255, "_pred": 1256, "_6": 1257, ".to": 1258, "']": 1259, "edd": 1260, "_instance": 1261, "mp": 1262, "SE": 1263, "_like": 1264, "_bool": 1265, "_+---": 1266, "_per": 1267, "\".format": 1268, "_left": 1269, "_bu": 1270, "_Returns": 1271, "_case": 1272, "_scal": 1273, "_Ar": 1274, "er(": 1275, "_freq": 1276, "anel": 1277, "ed\n": 1278, "t,": 1279, "ze": 1280, "ension": 1281, "3,": 1282, "_infer": 1283, "_pair": 1284, "_self._s": 1285, "_sy": 1286, "aN": 1287, "_@": 1288, "-+\n": 1289, "tx": 1290, "old": 1291, "_repr": 1292, "_shape": 1293, "ime": 1294, "AR": 1295, "bu": 1296, "Partitonns": 1297, "self.": 1298, "_seq": 1299, "wo": 1300, "alias": 1301, "_table": 1302, "._jvm.functions.": 1303, "_logger.in": 1304, "_logger.info": 1305, "_face": 1306, "_os.": 1307, "ers": 1308, "ception": 1309, "_mode": 1310, "`,": 1311, "_may": 1312, "len": 1313, "_datetime": 1314, "_0\n": 1315, "ence": 1316, "_mat": 1317, "_mod": 1318, "5,": 1319, "_iterator": 1320, "_>=": 1321, "ign": 1322, "raction": 1323, "input": 1324, "_target": 1325, "ved": 1326, "Matrix": 1327, "_memory": 1328, "ive": 1329, "_ab": 1330, "s,\n": 1331, "wise": 1332, "_ign": 1333, "ari": 1334, "sing": 1335, "-like": 1336, "=0": 1337, "ized": 1338, "_clo": 1339, "lib": 1340, "_repres": 1341, "g.ap": 1342, "arrk": 1343, "_x:": 1344, "_does": 1345, "_'201": 1346, "_optional": 1347, "_'b": 1348, "_rows": 1349, "trained": 1350, "_MultiIndex": 1351, "_save": 1352, "_bound": 1353, "any": 1354, "_right": 1355, "struct": 1356, "org.ap": 1357, "_dif": 1358, "amed": 1359, "_requ": 1360, "ures": 1361, "_two": 1362, "_indices": 1363, "_ids": 1364, "_wrapp": 1365, "_ctx": 1366, "ose": 1367, "_di": 1368, "(o": 1369, "load": 1370, "_non-": 1371, "_numpy": 1372, "(cl": 1373, "a',": 1374, "_/": 1375, "_sequence": 1376, "ession": 1377, "abeled": 1378, "abeledP": 1379, "(df": 1380, "_slice": 1381, "_dtype=": 1382, "_encod": 1383, "_returned": 1384, "\")\n\n": 1385, "_10": 1386, "_equ": 1387, "est:": 1388, "s.append": 1389, "_pyspark.sql": 1390, "ummary": 1391, "ibut": 1392, "_oper": 1393, "'),": 1394, "conf": 1395, "-\n": 1396, "urce": 1397, "gh": 1398, "_empty": 1399, "_pl": 1400, "ite": 1401, "_doct": 1402, "_doctest:": 1403, "QL": 1404, "\"\"\"\n": 1405, ".types": 1406, "_Whe": 1407, "_pass": 1408, "_exception": 1409, "er,": 1410, "(ell": 1411, ",\n\n": 1412, "asestring": 1413, "ayer": 1414, ".shape": 1415, "_read": 1416, "`.\n": 1417, "(sel": 1418, "Le": 1419, "_sets": 1420, ").alias": 1421, "_matrix": 1422, "ear": 1423, "_charact": 1424, "_logger.info(\"": 1425, "inng": 1426, "io": 1427, "og": 1428, "ail": 1429, "_100": 1430, "org.apache": 1431, "verter": 1432, "__make": 1433, "_bin": 1434, "_multiple": 1435, "_unique": 1436, "_mean": 1437, "ado": 1438, "_ter": 1439, "date": 1440, "ateway": 1441, "write": 1442, "_logit": 1443, "_holiday": 1444, "rou": 1445, "_sin": 1446, "pee": 1447, "_drop": 1448, "_numeric": 1449, "_getattr": 1450, "_pres": 1451, "_cache": 1452, "ets": 1453, "ByKey": 1454, ".map": 1455, ".cco": 1456, "_query": 1457, "_1|": 1458, "_emb": 1459, "_--------\n": 1460, "_..\n\n": 1461, "_how": 1462, "_int(": 1463, "ready": 1464, "back": 1465, "_is\n": 1466, ".n": 1467, "att": 1468, "sum": 1469, "_bet": 1470, "ed::": 1471, "ending": 1472, "ggreg": 1473, "_NaN": 1474, "result": 1475, "_categor": 1476, "Duration": 1477, "``,": 1478, "_su": 1479, "_labels": 1480, "_acc": 1481, "_prov": 1482, "_We": 1483, "_msg": 1484, "cept": 1485, "_requir": 1486, "-01-": 1487, "_a\n": 1488, "ry": 1489, "lic": 1490, "_False\n": 1491, "_error": 1492, "cond": 1493, "_long": 1494, "_basestring": 1495, "_LabeledP": 1496, "_spark.createDataFrame([": 1497, "jor": 1498, "_tf": 1499, "orch": 1500, "list": 1501, "_(\"": 1502, "(0,": 1503, "_point": 1504, "olean": 1505, "_hasattr": 1506, "_verify": 1507, "i]": 1508, "pute": 1509, "_and\n": 1510, "ix": 1511, "_containing": 1512, "ister": 1513, "Row": 1514, "_3.": 1515, "quet": 1516, "_Series": 1517, "_dir": 1518, "(len": 1519, "_already": 1520, "ty": 1521, "())": 1522, "_heap": 1523, "Java": 1524, "_prob": 1525, "IP": 1526, "_fol": 1527, "ased": 1528, "pyspark.sql": 1529, "_head": 1530, "_codes": 1531, "ointer": 1532, "_feature": 1533, "_instead": 1534, ".name": 1535, "_element": 1536, "ause": 1537, "_self._": 1538, "level": 1539, "1',": 1540, "_reduce": 1541, "ML": 1542, "_Number": 1543, "_period": 1544, "ql_ctx": 1545, "SK": 1546, "pandas": 1547, "orrup": 1548, "mask": 1549, "_encoding": 1550, "oad": 1551, "ang": 1552, "_where": 1553, "\":": 1554, "_cal": 1555, "a,": 1556, "string": 1557, "RE": 1558, "ome": 1559, "[:": 1560, "_argument": 1561, "(b": 1562, "count": 1563, "lect)\n\n\n": 1564, "adoop": 1565, "_+---+": 1566, "istic": 1567, "null": 1568, "'])\n": 1569, "assi": 1570, "_Struct": 1571, "_Exception": 1572, "ither": 1573, "_0,": 1574, "ts": 1575, "IN": 1576, "_lambda": 1577, "0:": 1578, "ARK": 1579, "_cre": 1580, "lee": 1581, "_checkpoint": 1582, "_warning": 1583, "pect": 1584, "_replace": 1585, "_**kwargs):\n": 1586, "_bias": 1587, "_Datetime": 1588, "(k": 1589, "_them": 1590, "_(e": 1591, "x,": 1592, "_items": 1593, "(dt": 1594, "tim": 1595, "dtype": 1596, "adata": 1597, "_cls._": 1598, "_while": 1599, "stem": 1600, "(rdd": 1601, "_original": 1602, "_fraction": 1603, ".group": 1604, "_self.c": 1605, "Column": 1606, "_jc": 1607, "quenc": 1608, "_files": 1609, "f.": 1610, "ain": 1611, "_8": 1612, "_obj.": 1613, "dt": 1614, "arrow": 1615, ".u": 1616, "_of\n": 1617, "():\n": 1618, "recated": 1619, "_See": 1620, "]))\n": 1621, "uto": 1622, "_St": 1623, "(values": 1624, "enti": 1625, "_string,": 1626, "day": 1627, "_1:\n": 1628, "(name": 1629, "size": 1630, "_you": 1631, "atche": 1632, "None,": 1633, "Ex": 1634, ".st": 1635, "(key": 1636, "til": 1637, "we": 1638, "_next": 1639, "fter": 1640, "cat": 1641, "_to_java": 1642, "(col": 1643, "(data,": 1644, "ocab": 1645, "qa": 1646, "_ensure": 1647, "_mis": 1648, "ations": 1649, "_represent": 1650, "ok": 1651, "':\n": 1652, "org.apache.s": 1653, "s)\n\n": 1654, "efined": 1655, "PARK": 1656, "_merge": 1657, "_split": 1658, "zero": 1659, "_interp": 1660, "_follow": 1661, "_app": 1662, "func:`": 1663, "_\"\"\"R": 1664, "')\n\n": 1665, "_more": 1666, "_name,": 1667, ".e": 1668, "_also": 1669, ":\n:\n": 1670, "_dt": 1671, "(cls,": 1672, "Sp": 1673, "_after": 1674, "Size": 1675, "cending": 1676, "_[1": 1677, "=u'Alice": 1678, "Session": 1679, "quency": 1680, "izer": 1681, "----": 1682, "Qu": 1683, "sv": 1684, "_was": 1685, "_contin": 1686, "_print": 1687, "_prediction": 1688, "p,": 1689, "_fill": 1690, "left": 1691, "._jvm.": 1692, "Tpee": 1693, "Py": 1694, "_wheterr": 1695, "_norm": 1696, ").\n\n": 1697, "_writ": 1698, "_provid": 1699, ".ccolect)\n\n\n": 1700, "exx": 1701, "_indic": 1702, "Class": 1703, "')]\n": 1704, "_stage": 1705, "_:func:`": 1706, "(sc,": 1707, "_Vector": 1708, "uster": 1709, "Time": 1710, "_self.sql_ctx": 1711, "_character": 1712, "Schema": 1713, "ndarray": 1714, "SEP": 1715, "_axes": 1716, "_its": 1717, "_source": 1718, "_struct": 1719, "_weights": 1720, "_path,": 1721, "ump": 1722, "_zip": 1723, "_process": 1724, "_integer": 1725, "(1,": 1726, ")\n)\n\n": 1727, "_series": 1728, "_metadata": 1729, "_{'": 1730, "_data,": 1731, "[\"": 1732, "19": 1733, ".re": 1734, "..": 1735, "_fil": 1736, "_step": 1737, "_i,": 1738, "Converter": 1739, "Se": 1740, "mean": 1741, "pon": 1742, "stream": 1743, "_+SK": 1744, "_+SKIP": 1745, "_gateway": 1746, "_os.path": 1747, "th,": 1748, "bin": 1749, "ED": 1750, "=\"": 1751, "_boolean": 1752, "org.apache.sarrk": 1753, "_verifi": 1754, "ength": 1755, "_(e.g.": 1756, "vi": 1757, "partitonn": 1758, "_yield": 1759, "orageLe": 1760, "_self.map": 1761, "fil": 1762, "_Py": 1763, "req": 1764, ".,": 1765, "token": 1766, "edelta": 1767, "_DatetimeIndex": 1768, "_dd": 1769, "_direct": 1770, "_{}\".format": 1771, "enn": 1772, "resh": 1773, "unk": 1774, "_Conver": 1775, "_supported": 1776, "_back": 1777, "column": 1778, "_evalu": 1779, "_attribut": 1780, "_keys": 1781, "4,": 1782, "_prefix": 1783, "(w": 1784, "_neg": 1785, "(self._j": 1786, "uplic": 1787, "dered": 1788, "To": 1789, "nce": 1790, "_versionadd": 1791, "--+": 1792, "_word": 1793, "sub": 1794, "sw": 1795, "amples\n": 1796, "s.ap": 1797, "_state_dict": 1798, "_layer": 1799, "_dtype='": 1800, "_there": 1801, "_K": 1802, "_either": 1803, "_sim": 1804, "_parse": 1805, "IG": 1806, "_Row": 1807, "_bec": 1808, "_tz": 1809, "__get": 1810, "ld": 1811, "=2": 1812, "lob": 1813, "iter": 1814, "(in": 1815, "_sock": 1816, "(['": 1817, "lel": 1818, "_des": 1819, "_aggreg": 1820, "timat": 1821, "_system": 1822, "(g": 1823, "_pyspark": 1824, "_att": 1825, "_+SKIP\n": 1826, "_'2018": 1827, "_code": 1828, "_training": 1829, "_representatonn": 1830, "_StructType": 1831, "),,": 1832, "_hand": 1833, "ocal": 1834, "ie": 1835, "sp": 1836, "b',": 1837, "sh": 1838, "_info": 1839, "take": 1840, "ampling": 1841, "ient": 1842, "',,": 1843, ")]\n\n": 1844, "_u'": 1845, "_vari": 1846, "ism": 1847, "_isinstance(s": 1848, "eff": 1849, "_expression": 1850, "uments": 1851, "_basestring):\n": 1852, "ild": 1853, "sor": 1854, "_Sparse": 1855, "_\"\"\"Return": 1856, "ties": 1857, "_Pandas": 1858, "SON": 1859, "_scalar": 1860, "'],": 1861, "(sc._jvm.functions.": 1862, "_noqa": 1863, "erver": 1864, "_Examples\n": 1865, "_kn": 1866, "option": 1867, "_open": 1868, "_<=": 1869, "(0": 1870, "mall": 1871, ")]": 1872, "//": 1873, "_int,": 1874, "(at": 1875, "23": 1876, "_arr": 1877, "_)\n": 1878, "_#\n": 1879, "_because": 1880, "_age": 1881, "ared": 1882, "titi": 1883, "sist": 1884, "ining": 1885, "Iter": 1886, "_ent": 1887, "_Al": 1888, "_versionadded::": 1889, "_categorical": 1890, "_join": 1891, "_``f": 1892, "_proj": 1893, "_Column(sc._jvm.functions.": 1894, "_context": 1895, "_seq_length": 1896, "own": 1897, ".append": 1898, "ilar": 1899, "_de": 1900, "c)\n": 1901, "imension": 1902, "imal": 1903, "_diffe": 1904, "_match": 1905, "ween": 1906, "ssible": 1907, "_provided": 1908, "_0.0": 1909, "_zero": 1910, "_temp": 1911, "_validate": 1912, "ffix": 1913, "_:class:`pyspark.sql": 1914, "``.": 1915, "ecord": 1916, "gment": 1917, "_noqa\n": 1918, "orrupt": 1919, "_arch": 1920, "_pretrained": 1921, "_ndim": 1922, "_dis": 1923, "_Create": 1924, "our": 1925, "_module": 1926, "_top": 1927, "'):\n": 1928, "np.": 1929, "(value": 1930, "a\",": 1931, "name,": 1932, "32": 1933, "_arrow": 1934, "_inn": 1935, "_some": 1936, "_bef": 1937, "_before": 1938, "(*": 1939, "_4,": 1940, "_ascending": 1941, "_None,": 1942, "log": 1943, "(_to": 1944, "MLlib": 1945, "_features": 1946, "_frequency": 1947, "timator": 1948, "_interval": 1949, "_cls": 1950, "_frame": 1951, "_examples": 1952, "SV": 1953, "_na": 1954, "s[0]": 1955, ".b": 1956, "are": 1957, "amedt": 1958, "Un": 1959, "amme": 1960, "ternal": 1961, "_wor": 1962, "_Arrow": 1963, "how": 1964, "OD": 1965, "_self._get": 1966, "_desc": 1967, "_1),": 1968, "_7": 1969, "ant": 1970, "heap": 1971, "_based": 1972, "_enum": 1973, "ored": 1974, "met": 1975, "MLlibFunc": 1976, "llib": 1977, "_init": 1978, "_mon": 1979, "datetime": 1980, "_contains": 1981, "_find": 1982, "reshold": 1983, "c)": 1984, "_inclu": 1985, "tp": 1986, "LE": 1987, "%s": 1988, "rip": 1989, "])\n\n": 1990, "_write": 1991, "_serializer": 1992, "_partitonns": 1993, "Python": 1994, "orageLevel": 1995, "_apply": 1996, "_warnings.": 1997, "war": 1998, "_samples": 1999, "d,": 2000, "_numPartitonns": 2001, "As": 2002, "=None,\n": 2003, "_file,": 2004, "_@param": 2005, "_enumer": 2006, "(df.": 2007, "_callMLlibFunc": 2008, "_values\n": 2009, "base": 2010, "_SQL": 2011, "_:class:`pyspark.sql.types": 2012, ").alias('": 2013, "year": 2014, "_dates": 2015, "_returnType": 2016, "_tok": 2017, "_sk": 2018, "_best": 2019, "right": 2020, "-8": 2021, "_ndarray": 2022, "_An": 2023, ".item": 2024, "__.": 2025, "().": 2026, "_could": 2027, "_to\n": 2028, "ding": 2029, "onon": 2030, "(i": 2031, "elet": 2032, "_ignore": 2033, "icode": 2034, "_operation": 2035, "_[1,": 2036, "(x,": 2037, "_deprecated": 2038, "reduce": 2039, "_take": 2040, "ater": 2041, "_run": 2042, ")))": 2043, "_second": 2044, "_appl": 2045, "_between": 2046, "_or\n": 2047, "_enumerate": 2048, "_value\n": 2049, "_transform": 2050, "be": 2051, "sc,": 2052, "_np": 2053, "_JSON": 2054, "_2|": 2055, "',',": 2056, "rence": 2057, "Record": 2058, "RO": 2059, "_span": 2060, "ndim": 2061, "ition": 2062, ".join(": 2063, "rt": 2064, "_distance": 2065, "_Convert": 2066, "top": 2067, "`.": 2068, "sql": 2069, "_Note": 2070, "int64": 2071, "_sql": 2072, "sive": 2073, "idd": 2074, "cre": 2075, ")],": 2076, "_numPartitonns=": 2077, "(other": 2078, "com": 2079, "_here": 2080, "_generate": 2081, "Or": 2082, "_Hadoop": 2083, "_compression": 2084, "ables": 2085, "']\n": 2086, "Tr": 2087, "Of": 2088, "__to_java": 2089, "Bob": 2090, "(start": 2091, "_2.0": 2092, "_\"\"\"Returns": 2093, "allow": 2094, "izatonn": 2095, "_ep": 2096, "ideDuration": 2097, "_Also": 2098, "_0.2": 2099, "_00:": 2100, "_invalid": 2101, "s.appe": 2102, "_termin": 2103, "_score": 2104, "_continue": 2105, "n't": 2106, "open": 2107, "TF": 2108, "_lib": 2109, "_since": 2110, "_equal": 2111, "String": 2112, "ial": 2113, ".a": 2114, "obj,": 2115, "__,": 2116, "_k,": 2117, "df,": 2118, "_proper": 2119, "lobal": 2120, ".ex": 2121, "_Group": 2122, "ER": 2123, "_hash": 2124, "_es": 2125, "ME": 2126, "ves": 2127, "With": 2128, "_subset": 2129, "_Random": 2130, "For": 2131, "_sampling": 2132, "_self.get": 2133, ".write": 2134, "attern": 2135, "i,": 2136, "_interpol": 2137, "of": 2138, "},": 2139, "_To": 2140, "_[\"": 2141, "Per": 2142, "oint(": 2143, "_vocab": 2144, "irst": 2145, "_self.sql_ctx)": 2146, ".values": 2147, "sort": 2148, "_Dense": 2149, "atio": 2150, "-defined": 2151, "_[SEP": 2152, "_panel": 2153, "_Add": 2154, "Ch": 2155, "_Load": 2156, "redict": 2157, "_resulting": 2158, "ating": 2159, "format": 2160, "race": 2161, ".data": 2162, "([1,": 2163, "_got": 2164, "Length": 2165, "_When": 2166, "_None)\n": 2167, "_specify": 2168, "_summary": 2169, "_compute": 2170, "keep": 2171, "Num": 2172, "_ev": 2173, "_C{": 2174, "Val": 2175, "lection": 2176, "c,": 2177, "_stat": 2178, "_appro": 2179, "_Column(j": 2180, "=u'Bob": 2181, "Me": 2182, ".mllib": 2183, "args,": 2184, "ular": 2185, "__java": 2186, "ival": 2187, "ivalent": 2188, "pos": 2189, "97": 2190, "_user-defined": 2191, "config": 2192, "_pointer": 2193, "_segment": 2194, "_list_like": 2195, "ication": 2196, "pa": 2197, "_location": 2198, "_sup": 2199, "s),": 2200, ".com": 2201, "_key,": 2202, "_String": 2203, "_work": 2204, "age=": 2205, "l.": 2206, "rer": 2207, "uff": 2208, "Com": 2209, "(pa": 2210, "lose": 2211, "_be\n": 2212, "ak": 2213, "sign": 2214, ".un": 2215, "_[('": 2216, "_(2,": 2217, "Partitonns(": 2218, "pected": 2219, "_9": 2220, "itt": 2221, "ever": 2222, "_buck": 2223, "AP": 2224, "mon": 2225, "_arguments": 2226, "word": 2227, "ank": 2228, "_callMLlibFunc(\"": 2229, "_document": 2230, "Info": 2231, "_->": 2232, "_SparseVector": 2233, "_register": 2234, "umn": 2235, "_ro": 2236, "java": 2237, "_bool,": 2238, "_resol": 2239, "_jav": 2240, "LS": 2241, "ftmax": 2242, "igh": 2243, "_print(\"": 2244, ".split": 2245, "on't": 2246, "ection": 2247, "_ht": 2248, "-s": 2249, "tegerType": 2250, "most": 2251, "ward": 2252, "_different": 2253, "_datetime64": 2254, "_beh": 2255, "2\n": 2256, "annot": 2257, "zip": 2258, "_It": 2259, "_called": 2260, "_possible": 2261, "(ex": 2262, "(x)": 2263, "_self.is": 2264, "_stop": 2265, "Replace": 2266, "int(": 2267, ")\nt": 2268, "_in\n": 2269, "ied": 2270, "10": 2271, "(st": 2272, "vm.": 2273, "_trans": 2274, "_outpu": 2275, "_distri": 2276, "_ali": 2277, "_ValueError('": 2278, "transform": 2279, "rees": 2280, ".\"\"\"\n": 2281, "-2": 2282, "replace": 2283, "_cluster": 2284, ".weight": 2285, "=[": 2286, "=u'Alice',": 2287, "anti": 2288, "rection": 2289, "label": 2290, "ift": 2291, "_ns": 2292, "ParamMap": 2293, "_construct": 2294, "_groupby": 2295, "_esc": 2296, "_axis=": 2297, "_ob": 2298, "_aut": 2299, "aces": 2300, "_pick": 2301, "_remo": 2302, ".con": 2303, "_height": 2304, "ann": 2305, "_\"b": 2306, "_e.g.": 2307, "s()": 2308, "object": 2309, "for": 2310, "_behav": 2311, "_True,": 2312, "SPARK": 2313, "bine": 2314, "lease": 2315, "_python": 2316, "_blocks": 2317, "educe": 2318, "_1)": 2319, "ctu": 2320, "rea": 2321, "_wrapped": 2322, "`.\n\n\n": 2323, "_\"\"\"S": 2324, "=j": 2325, "_wrapper": 2326, "ric": 2327, "_old": 2328, "_slideDuration": 2329, "').ccolect)\n\n\n": 2330, "_df.group": 2331, "pear": 2332, "_jav_c": 2333, "json": 2334, "indices": 2335, "_pd.Index": 2336, "_'2018-01-": 2337, "axis": 2338, "_und": 2339, "1:": 2340, "_small": 2341, "_IntegerType": 2342, "uc": 2343, "_recent": 2344, "_Data": 2345, "names": 2346, "_storage": 2347, "andard": 2348, "_cho": 2349, "=False):\n": 2350, "ev": 2351, "AL": 2352, "_Com": 2353, "s(self,": 2354, "{}": 2355, "ctx": 2356, "r)\n": 2357, ".from": 2358, "None):\n": 2359, "_tot": 2360, "(range": 2361, ".\")\n": 2362, "_sq": 2363, "ower": 2364, "etermin": 2365, "_fail": 2366, "rdd_des": 2367, "').": 2368, "_functions": 2369, "nan": 2370, "rel": 2371, "gr": 2372, "freq": 2373, "_jdf": 2374, "ving": 2375, "[ns": 2376, "best": 2377, "ignore": 2378, "_tokenizer": 2379, "tension": 2380, "_see": 2381, "rough": 2382, "dir": 2383, ".load": 2384, "_once": 2385, "]]": 2386, "raceback": 2387, "s))\n": 2388, "VM": 2389, "cal": 2390, "ested": 2391, ").s": 2392, "tes": 2393, "OR": 2394, "_descri": 2395, "float": 2396, "_total": 2397, "_5,": 2398, "5\n": 2399, "_duplic": 2400, "_assum": 2401, "2.": 2402, "oll": 2403, "_std": 2404, "Iteration": 2405, "plement": 2406, "dict": 2407, "va": 2408, "_isinstance(col": 2409, "_convert_to": 2410, "_LabeledPoint": 2411, "_LabeledPoint(": 2412, "_mo": 2413, "_+------": 2414, "[0]\n": 2415, "_sdf": 2416, "(result": 2417, "_sent": 2418, "idx": 2419, "Ratio": 2420, "_[Row": 2421, "match": 2422, "(np.": 2423, "NameOf": 2424, "NameOfC": 2425, "NameOfCorrupt": 2426, "NameOfCorruptRecord": 2427, "_``false": 2428, "_values.": 2429, "_model_name": 2430, "idden": 2431, "_Also\n": 2432, "gine": 2433, "ne": 2434, "_specified,": 2435, "_within": 2436, "),),": 2437, "_index,": 2438, "s://": 2439, "e)\n\n": 2440, "s():\n": 2441, "__create": 2442, "Type,": 2443, ")\ne)\n": 2444, "=True,": 2445, "_they": 2446, "has": 2447, "_Tim": 2448, ".ap": 2449, ".dt": 2450, "_Y": 2451, "}\n": 2452, "quared": 2453, "[i]": 2454, "_rever": 2455, "\"]": 2456, "_preser": 2457, "):": 2458, "_warnings.war": 2459, "_[0,": 2460, "erial": 2461, "(num": 2462, "info": 2463, "_depth": 2464, "s[i]": 2465, "_Key": 2466, "_func,": 2467, "[1,": 2468, "_generated": 2469, "_Column(jc)": 2470, "_wrap": 2471, "_cent": 2472, "(s)": 2473, "_[Row(name": 2474, "_dropna": 2475, "_existing": 2476, "_sc._jvm.functions.": 2477, "``:": 2478, "'|": 2479, "_df.groupby": 2480, "Format": 2481, "oton": 2482, "Block": 2483, "_np.ndarray": 2484, "_major": 2485, "_obj.co": 2486, "_torch": 2487, "edding": 2488, "CLS": 2489, "_answ": 2490, "_softmax": 2491, "_nans": 2492, "_classi": 2493, "_path:": 2494, "_through": 2495, "=k": 2496, "_list(": 2497, "_Par": 2498, "la": 2499, "_Traceback": 2500, "_(most": 2501, "_last):\n": 2502, "amedtuple": 2503, "Field": 2504, "atte": 2505, "_been": 2506, "tz": 2507, "_day": 2508, "_throw": 2509, "_perform": 2510, "(path": 2511, "_side": 2512, "CT": 2513, "abled": 2514, "ed.\n": 2515, "_Not": 2516, "_negative": 2517, "_try": 2518, "(ellf,": 2519, "artit": 2520, "yn": 2521, "_filter": 2522, "(temp": 2523, ".i": 2524, "_Window": 2525, "_rank": 2526, "_convert_to_vector": 2527, "Pro": 2528, ".set": 2529, ".find": 2530, ".start": 2531, "_self._sc": 2532, "_equivalent": 2533, "__to_java_column": 2534, "_'B": 2535, "pace": 2536, "prob": 2537, "'))\n": 2538, "_spark.createDataFrame([('": 2539, "00:": 2540, "BC": 2541, "VE": 2542, "UDF": 2543, "_being": 2544, "_``\\": 2545, "_self._jwrite": 2546, "_server": 2547, "_minor": 2548, "_state['": 2549, "nt64": 2550, "_is_list_like": 2551, "go": 2552, "_directory": 2553, "_pickle": 2554, "_object\n": 2555, "_'f": 2556, "_times": 2557, "arch": 2558, "Fi": 2559, "CE": 2560, "field": 2561, "(obj,": 2562, "_isinstance(obj,": 2563, "_None\n\n": 2564, "_verifier": 2565, "alll": 2566, "_False,": 2567, "ool": 2568, "_TOD": 2569, "_TODO": 2570, "_handle": 2571, "ous": 2572, "ior": 2573, "_Wheterr": 2574, "_global": 2575, ".close": 2576, "_values,": 2577, "1\n": 2578, "_both": 2579, "_fl": 2580, ").collect()\n": 2581, "_replacement": 2582, "_cannot": 2583, "Co": 2584, "ett": 2585, "_other.": 2586, ".read": 2587, "_entry": 2588, "[0],": 2589, "_value.": 2590, "(a": 2591, "_(list": 2592, "_configuration": 2593, "Serializer": 2594, "_(c": 2595, "rap": 2596, "_just": 2597, "_needs": 2598, "_cols": 2599, "other,": 2600, "ms": 2601, "_indicates": 2602, "rad": 2603, "_database": 2604, "schema": 2605, "Weight": 2606, "-+-+\n": 2607, "(col,": 2608, "_ja": 2609, "essage": 2610, "url": 2611, "_kind": 2612, "_separ": 2613, "_1.0|": 2614, "aping": 2615, "_lineS": 2616, "_lineSep": 2617, "_``false`.\n\n": 2618, "otonic": 2619, "_missing": 2620, "major": 2621, "datetime64": 2622, "mod": 2623, "_optional\n": 2624, "_archive": 2625, "_answer": 2626, "_max_seq_length": 2627, "_timedelta": 2628, "_list-like": 2629, "000-01": 2630, "_Panel": 2631, "_Train": 2632, "round": 2633, "_'w": 2634, "_threshold": 2635, "54": 2636, "ype,": 2637, "s\n\n": 2638, "ility": 2639, "_list):\n": 2640, "_Array": 2641, "elem": 2642, "_accept": 2643, "_JVM": 2644, "new": 2645, "_require": 2646, "_standard": 2647, "_behavior": 2648, "_upd": 2649, "Reg": 2650, "_Gener": 2651, "Line": 2652, "oid": 2653, "Warning": 2654, "amm": 2655, "_otherwise": 2656, "_1\n\n": 2657, "_&": 2658, "ia": 2659, "_3.0": 2660, "ini": 2661, "_[0": 2662, "ten": 2663, "rdd_deserializer": 2664, "_created": 2665, "atorr": 2666, "_pattern": 2667, "_closed": 2668, "(e": 2669, "_Tr": 2670, "_job": 2671, "rol": 2672, "_these": 2673, ".or": 2674, "_isinstance(other,": 2675, "_cond": 2676, "\",\n": 2677, "ization": 2678, "ution": 2679, "_distribu": 2680, "_distribution": 2681, "_update": 2682, "_self._jdf": 2683, "_data.": 2684, "_sqlContext": 2685, "({": 2686, "astype": 2687, "...": 2688, "_embed": 2689, ".copy": 2690, "(_to_jav_c": 2691, "ffset": 2692, "_UDF": 2693, "_infe": 2694, "_quot": 2695, "IVE": 2696, "_stride": 2697, "_As": 2698, "_dense": 2699, "_model_name_or": 2700, "fier": 2701, ".default": 2702, "s,,": 2703, "atched": 2704, "_tto": 2705, "arge": 2706, "tps://": 2707, "lower": 2708, "_name\n": 2709, "_namedtuple": 2710, "_inf": 2711, "_name=": 2712, "us": 2713, "_binary": 2714, "uring": 2715, "aving": 2716, "_Row(name": 2717, "_Run": 2718, "_evaluate": 2719, "mee": 2720, "alues": 2721, "Mo": 2722, "(index": 2723, "_avoid": 2724, "(2,": 2725, "inct": 2726, "Replacement": 2727, "4\n": 2728, "_keep": 2729, "icient": 2730, "_other):\n": 2731, "_records": 2732, "Reduce": 2733, "d',": 2734, "_fall": 2735, "self": 2736, "_aggregate": 2737, "_cur": 2738, "_means": 2739, ".save": 2740, "quence": 2741, "_batchSize": 2742, "_avg": 2743, "Group": 2744, "_task": 2745, "_RDD.\n": 2746, "_true": 2747, "_inv": 2748, "del": 2749, "_consi": 2750, "_estimator": 2751, "(h": 2752, "_*args,": 2753, "_attributes": 2754, "(ot": 2755, "_5|": 2756, "name',": 2757, "_df.": 2758, "=False,": 2759, ")|": 2760, "_sep": 2761, "ites": 2762, "itespace": 2763, "ipy": 2764, "_NumPy": 2765, "_Im": 2766, "_start_position": 2767, "_engine": 2768, "_grouper": 2769, "_meta": 2770, "_2000-01": 2771, "(name,": 2772, "[1]": 2773, "_found": 2774, "[i": 2775, "_results": 2776, "55": 2777, "IL": 2778, "\":\n": 2779, "__parse": 2780, "mit": 2781, "_e:\n": 2782, "_Check": 2783, "b\",": 2784, "_pyarrow": 2785, "_pdf": 2786, "_:py": 2787, "_:py:": 2788, "uffle": 2789, "_dump": 2790, "_self.values": 2791, "_port": 2792, "_assign": 2793, "_self.ctx": 2794, "_('b',": 2795, "(func": 2796, "_sum": 2797, "]).": 2798, "uar": 2799, "_want": 2800, "amma": 2801, "_another": 2802, "(1)\n": 2803, "Dep": 2804, "_it\n": 2805, "_actu": 2806, "_''": 2807, "t-": 2808, "(to": 2809, "Str": 2810, "ute": 2811, "Spark": 2812, "respon": 2813, "Window": 2814, "_child": 2815, "_parent": 2816, "_pyspark.mllib": 2817, "essonn": 2818, "All": 2819, "Function": 2820, "_**kwargs)\n": 2821, "_Stream": 2822, "_Streaming": 2823, "_dstream": 2824, "innd": 2825, "_DataFrame(j": 2826, "--+\n\n": 2827, "ST": 2828, ".column": 2829, "true": 2830, "_message": 2831, "_ever": 2832, "__heap": 2833, "_cop": 2834, "_paramMap": 2835, "Tpee`": 2836, "_exclu": 2837, "_parsing": 2838, "_CSV": 2839, "_allows": 2840, "_whitespace": 2841, "_Import": 2842, "register": 2843, "_slic": 2844, "ensor": 2845, "_pre-": 2846, "_end_position": 2847, "_under": 2848, "gorith": 2849, "_Use": 2850, "ott": 2851, "line": 2852, ".en": 2853, "_del": 2854, "ake": 2855, "_similar": 2856, "bl": 2857, "_look": 2858, "_\"c": 2859, "_objects": 2860, "_don't": 2861, "mark": 2862, "_type.": 2863, "._jvm.org.apache.sarrk": 2864, "_compati": 2865, "_mapp": 2866, "ision": 2867, "(obj)\n": 2868, "__make_type": 2869, "ed,": 2870, "n,": 2871, "12": 2872, "_conversion": 2873, "_without": 2874, "_during": 2875, "_pd": 2876, "=onn": 2877, "_addition": 2878, "erg": 2879, "_cle": 2880, "_reverse": 2881, "(iter": 2882, "50": 2883, "_-1:\n": 2884, "_unicode": 2885, "',\n": 2886, "_Set": 2887, "_comput": 2888, "ed.": 2889, "_2),": 2890, "uaran": 2891, "uarante": 2892, "1.": 2893, "_0.9": 2894, "lambda": 2895, "ait": 2896, "_collect": 2897, "_final": 2898, "buck": 2899, "umul": 2900, "_(list,": 2901, "_continue\n": 2902, "_form": 2903, "_(None": 2904, "allelism": 2905, "_abs(": 2906, "do": 2907, "rier": 2908, ").alias(\"": 2909, "_condition": 2910, "_usage": 2911, "--+\n--+": 2912, "_Bob": 2913, "over": 2914, "all(\"": 2915, "model": 2916, "_path):\n": 2917, "ressonn": 2918, "Sub": 2919, "_``spark.sql": 2920, "chema,": 2921, "ress": 2922, "_correct": 2923, "random": 2924, "_DataFrame(jdf,": 2925, "_following": 2926, "_+---+-----": 2927, "Pandas": 2928, "**": 2929, "_every": 2930, "_nan": 2931, "_concat": 2932, "_'C": 2933, "_self._df": 2934, "inesis": 2935, "_\".join": 2936, "_stub": 2937, "pickle": 2938, "_KeyError": 2939, "_pretrained_model_name_or": 2940, "_pretrained_model_name_or_at": 2941, "_result.": 2942, "_masked": 2943, "_GH": 2944, "_self.group": 2945, "_2000-01-01": 2946, "_periods": 2947, "_data.\n": 2948, "_many": 2949, "=0.": 2950, "ION": 2951, "_Exception(\"": 2952, "_function\n": 2953, ".D": 2954, "_bel": 2955, "_compar": 2956, "-b": 2957, "\"):\n": 2958, "_less": 2959, "_fast": 2960, "DA": 2961, "\".\n": 2962, "upported": 2963, "_(i": 2964, "_datatype": 2965, "8,": 2966, "_fields": 2967, "Type):\n": 2968, "_cast": 2969, "(new": 2970, "_f,": 2971, "_int64": 2972, "_is_datetime64": 2973, "_normal": 2974, "k,": 2975, "plic": 2976, "Dict": 2977, "Values": 2978, "python": 2979, "emory": 2980, "_2\n": 2981, "_chunk": 2982, "_inplace": 2983, "(sort": 2984, "ler": 2985, "kes": 2986, "_UTF": 2987, "f-8": 2988, "8\n": 2989, "(f,": 2990, "_x,": 2991, "_seed=None):\n": 2992, "_guarante": 2993, "DataFrame`.\n\n": 2994, "eg": 2995, "_1)\n": 2996, "_our": 2997, "_delta": 2998, "_union": 2999, "_even": 3000, "_self.mapPartitonns(": 3001, "ever,": 3002, "Op": 3003, "0.": 3004, "_jrdd": 3005, "ustom": 3006, "_list,": 3007, "_'p": 3008, "igger": 3009, "efficient": 3010, "arrier": 3011, "----+": 3012, "af": 3013, "_\"a": 3014, "ting": 3015, "=3": 3016, "ars": 3017, "_conn": 3018, "_closure": 3019, "_func._": 3020, "_ignored": 3021, "_suffix": 3022, "_windowDuration": 3023, "_ML": 3024, "_df2": 3025, "_defines": 3026, "80": 3027, "ues": 3028, "[ns]": 3029, "_NA": 3030, "_java_stage": 3031, "__java_obj.": 3032, "__java_obj.set": 3033, "_00:00:": 3034, "_csv": 3035, "_`pandas": 3036, "_lower": 3037, "_set,\n": 3038, "_quote": 3039, "_escape": 3040, "RA": 3041, "_ref": 3042, "_refer": 3043, "_diff": 3044, "_ImportEr": 3045, "_ImportError": 3046, "cel": 3047, "_preserve": 3048, "afe": 3049, "_streaming": 3050, "_writer": 3051, "_resolved": 3052, "_embedding": 3053, "_[CLS": 3054, "_input_mask": 3055, "utoff": 3056, "_logprob": 3057, "nt64In": 3058, "_obser": 3059, ".\n\n\n": 3060, "_Ch": 3061, "_algorith": 3062, "nn": 3063, "(model": 3064, "_wid": 3065, "_0)": 3066, "sample": 3067, "=1,": 3068, "_How": 3069, "_det": 3070, "uples": 3071, "image": 3072, "cul": 3073, "_DD": 3074, "_DDL": 3075, "Type(": 3076, "PT": 3077, "\n\n\n\n": 3078, ".strip": 3079, "(obj):\n": 3080, "_scale": 3081, "_dict):\n": 3082, "(row": 3083, "items": 3084, "_converter": 3085, "_it's": 3086, "oror": 3087, "ypes\n": 3088, "14": 3089, ".date": 3090, "sonn": 3091, "_TODO:": 3092, "Tim": 3093, "_for\n": 3094, "_intern": 3095, "ys": 3096, "_Get": 3097, "_proces": 3098, "_os.path.join": 3099, "_self.m": 3100, "[k": 3101, "_20": 3102, "UP": 3103, "CH": 3104, "56": 3105, "rag": 3106, "_preserves": 3107, ".map(lambda": 3108, "WithIndex": 3109, ".0\n\n": 3110, ";\n": 3111, "_iteration": 3112, "2)": 3113, "Partit": 3114, "_part": 3115, "_pairs": 3116, "_prod": 3117, "with": 3118, "erer": 3119, "oci": 3120, "_operator": 3121, "\"\n\n": 3122, "_implement": 3123, "_collection": 3124, "1.0,": 3125, ".sum": 3126, "_are\n": 3127, "_example,": 3128, ".h": 3129, "orary": 3130, "=True)\n": 3131, "ely": 3132, "ended": 3133, "Util": 3134, "App": 3135, "__(": 3136, "_[Row(age=": 3137, "_correspon": 3138, "(array": 3139, "_exec": 3140, "_isinstance(schema,": 3141, "_self._set": 3142, "_java_model": 3143, "Load": 3144, "_function.": 3145, "`\n\n": 3146, "_params": 3147, "_+---+--+\n\n": 3148, "(arr": 3149, "=u'Bob',": 3150, "height": 3151, "eterministic": 3152, "_numpy.": 3153, "range": 3154, "peat": 3155, "_extract": 3156, "uture": 3157, "pandas_udf": 3158, "_df.groupby('": 3159, "xt": 3160, "toc": 3161, "tocol": 3162, "_dtype=np.": 3163, "_DenseVector": 3164, "_Asser": 3165, "_Assertion": 3166, "_AssertionError": 3167, "asarray": 3168, "_model\n": 3169, "(msg": 3170, "_self.out": 3171, "_co.co": 3172, "_self.save": 3173, "('_": 3174, "_self._sh": 3175, "transformer": 3176, "tokens": 3177, "_len(input": 3178, "_hidden": 3179, "_'\n": 3180, "allow_copy": 3181, "_2.9": 3182, "_cython": 3183, "_holidays": 3184, "ese": 3185, "_larg": 3186, "oinng": 3187, "rary": 3188, "_Make": 3189, "_0),": 3190, "empty": 3191, "ailable": 3192, "_Option": 3193, "_points": 3194, "_tt": 3195, "tin": 3196, "_short": 3197, "_decimal": 3198, "ET": 3199, "_By": 3200, "_Sh": 3201, "Struct": 3202, "_onn": 3203, "atta": 3204, "_allowed": 3205, "_type(dt": 3206, "_Timestamp": 3207, "stt": 3208, "_converted": 3209, "_require_inn": 3210, "_require_innimum": 3211, "_versonn": 3212, "_nested": 3213, "local": 3214, "f1": 3215, "_comb": 3216, "fun": 3217, ".close()\n": 3218, "_pos": 3219, "ful": 3220, "\"),": 3221, "_pass\n": 3222, "_0x": 3223, "ross": 3224, "_defined": 3225, "_preservesPar": 3226, "_preservesPartiti": 3227, "_preservesPartitiining": 3228, "_withReplacement": 3229, "_probab": 3230, "_exact": 3231, "_fix": 3232, ".take": 3233, "_shuffle": 3234, "oun": 3235, "ice": 3236, "_partitonnFunc": 3237, "ian": 3238, "ali": 3239, "here": 3240, "2)\n": 3241, "_'c": 3242, "s[0]\n": 3243, "_1]": 3244, "_base": 3245, "_tempFile": 3246, "ec)\n)\n": 3247, "inner": 3248, "tract": 3249, "_place": 3250, "(rdd,": 3251, "_\"d": 3252, "Id": 3253, ".defaultPar": 3254, "rox": 3255, "Local": 3256, "_alias": 3257, "_keyword": 3258, "_sel": 3259, "ances": 3260, "_data:\n": 3261, "bName": 3262, "sparkSession": 3263, ".up": 3264, "_alway": 3265, "_center": 3266, "-3": 3267, "e,\n": 3268, "Streaming": 3269, ".for": 3270, "_long,": 3271, "see": 3272, "_+---\n\n": 3273, "=s": 3274, "how()\n": 3275, "_DataFrame(self._j": 3276, "_pd.DataFrame": 3277, "_'min": 3278, ".dot": 3279, "arter": 3280, "yy": 3281, "_special": 3282, "_`start": 3283, "IS": 3284, "_PandasUDF": 3285, "_PandasUDFType": 3286, "_self._df(sel": 3287, "_self._df(selre": 3288, "_self._df(selre_j": 3289, "formed": 3290, "_``column": 3291, "_(ex": 3292, "_DataFrame\n": 3293, "ifies": 3294, "_nn": 3295, "(self)": 3296, "Rows,": 3297, "att(": 3298, "_i.i": 3299, "_i.i.d": 3300, "_compat": 3301, "ais": 3302, "_pre-trained": 3303, "_tokens_b": 3304, "_lm": 3305, "sz": 3306, "_layer_str": 3307, "_make_invalid": 3308, "_make_invalid_op": 3309, "uffix": 3310, "_Cython": 3311, "_tree": 3312, "_underly": 3313, "\"))\n": 3314, "TE": 3315, "ottom": 3316, "_available": 3317, "es,": 3318, "2:": 3319, "List": 3320, "Type:\n": 3321, "_isinstance(data": 3322, "exp": 3323, "_verifier(": 3324, "(\"a\",": 3325, "ouble": 3326, "_ss": 3327, "__check": 3328, "a/": 3329, "_201": 3330, "_dtype:": 3331, "_parameters": 3332, "_type,": 3333, "(op": 3334, "type,": 3335, "version": 3336, "_cached": 3337, "_Runtime": 3338, "amame": 3339, "vir": 3340, "viron": 3341, "OC": 3342, "_iterator:\n": 3343, "_used_memory": 3344, "illed": 3345, "_merg": 3346, "lin": 3347, "-1]": 3348, "2',": 3349, "_from\n": 3350, "_versionch": 3351, "_versionchang": 3352, "(iterator": 3353, ".count": 3354, "_seed)": 3355, "Split": 3356, "_numPartitonns=None,": 3357, "hite": 3358, "_boundary": 3359, "(y": 3360, "pi": 3361, "_print(": 3362, "_ass": 3363, "_associ": 3364, "seq": 3365, ".add": 3366, "value,": 3367, "_interpolate": 3368, "Text": 3369, "odec": 3370, "Fil": 3371, "Temp": 3372, "'])": 3373, "_lines": 3374, "_partitonnBy": 3375, "_added": 3376, "_So": 3377, "(),\n": 3378, "_timeout": 3379, ".org": 3380, "this": 3381, "_:class:`Column": 3382, "_strings": 3383, "=5": 3384, "ores": 3385, "_term": 3386, "imilar": 3387, "_sc,": 3388, "_Max": 3389, "_Maximum": 3390, "ariance": 3391, "=4": 3392, "_grad": 3393, "Name,": 3394, "_schema,": 